; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v7 - type_3 ?v3 - type_2)
 	      (pred_2 ?v2 - object ?v3 - type_2)
	      (pred_4 ?v7 - type_3 ?v5 - type_1)
	      (pred_1 ?v7 - type_3 ?v2 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v6 ?v1 - type_2)
       :precondition (and  (pred_3 ?v7 ?v6))
       :effect (and  (pred_3 ?v7 ?v1)
		     (not (pred_3 ?v7 ?v6))))

   (:action op_3
       :parameters (?v7 - type_3 ?v8 - object ?v4 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v4) (pred_3 ?v7 ?v4) (pred_4 ?v7 ?v5))
       :effect (and (pred_1 ?v7 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v4)) 
		    (not (pred_4 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_3 ?v8 - object ?v4 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v8 ?v5) (pred_3 ?v7 ?v4))
       :effect (and (pred_2 ?v8 ?v4)
		    (pred_4 ?v7 ?v5)
		    (not (pred_1 ?v7 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_02 - type_3
obj_09 obj_14 obj_03 obj_01 - type_1
obj_11 obj_04 obj_08 obj_05 - type_2
obj_12 obj_13 obj_07 obj_10 - object)
(:init
(pred_3 obj_06 obj_04)
(pred_4 obj_06 obj_09)
(pred_4 obj_06 obj_14)
(pred_3 obj_02 obj_11)
(pred_4 obj_02 obj_03)
(pred_4 obj_02 obj_01)
(pred_2 obj_12 obj_11)
(pred_2 obj_13 obj_11)
(pred_2 obj_07 obj_08)
(pred_2 obj_10 obj_11)
)
(:goal
(and
(pred_2 obj_12 obj_11)
(pred_2 obj_13 obj_08)
(pred_2 obj_07 obj_05)
(pred_2 obj_10 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_06 obj_05) (pred_3 obj_02 obj_05))))
  )
)
)

; plan
1. (op_1 obj_06 obj_04 obj_11)
   deleted: (pred_3 obj_06 obj_04)
   added: (pred_3 obj_06 obj_11)
   goals met: 2 of 4
2. (op_3 obj_02 obj_13 obj_11 obj_01)
   deleted: (pred_2 obj_13 obj_11) (pred_4 obj_02 obj_01)
   added: (pred_1 obj_02 obj_13 obj_01)
   goals met: 2 of 4
3. (op_1 obj_02 obj_11 obj_08)
   deleted: (pred_3 obj_02 obj_11)
   added: (pred_3 obj_02 obj_08)
   goals met: 2 of 4
4. (op_2 obj_02 obj_13 obj_08 obj_01)
   deleted: (pred_1 obj_02 obj_13 obj_01)
   added: (pred_2 obj_13 obj_08) (pred_4 obj_02 obj_01)
   goals met: 3 of 4
5. (op_3 obj_02 obj_07 obj_08 obj_03)
   deleted: (pred_2 obj_07 obj_08) (pred_4 obj_02 obj_03)
   added: (pred_1 obj_02 obj_07 obj_03)
   goals met: 3 of 4
6. (op_1 obj_02 obj_08 obj_05)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_05)
   goals met: 3 of 4
7. (op_2 obj_02 obj_07 obj_05 obj_03)
   deleted: (pred_1 obj_02 obj_07 obj_03)
   added: (pred_2 obj_07 obj_05) (pred_4 obj_02 obj_03)
   goals met: 4 of 4
